

c_0106
	1, 编译指令 (cc -c ?.c)
	2, 链接指令 (cc c.o)
	3, 运行 (./a.out)

c_0108
	1, 编译运行 (cc ?.c)
	2, 标识符 
		数字 (不可开头)
		字母
		下划线

c_0121
	1, 输出int (%d)
	2, 输出char (%c)
	3, 输出float (%f)
	4, 输出double (%f)
	5, 输出long (%ld)
	6, 输出地址 (%p)

c_0128
	1, 内存分配规则
	2, 查看变量地址运算符 &

c_0209
	1, ~
	2, !
	

c_0414
	1, 汉字字节数 (三个)
	2, 字母字节数
	
c_0501
	1, 进制开头(二, 八, 十六)
	2, 输出八进制 (%o)
	3, 输出十六进制 (%x) 
	4, 内存地址分配

c_0510
	1, long, short, signed, unsigned	


c_060101
	1, 数组定义
	2, 数组初始化
	3, 数组名的意义

c_060104
	1, 数组声明时无定义个数无初始化: int a[];
	2, 数组名初始化: a = {1, 2}
	3, 数组初始化时定义的个数为变量 int b[i] = {1, 2};

c_060106
	1, 数组内存分配规则
		
c_060108
	1, 数组作为参数传递
	2, 指针占用字节数

c_060204
	1, strlen
	2, 字符数组和字符串的区别

c_060309
	1, 数组名的意义
	2, 数组元素的三种访问方式

c_060310
	1, 指针和数组
	2, 指针和字符串
	3, 字符串常量: “”
	4, 字符串变量: char x[]

c_060313
	1, 返回指针的函数
	2, 指向函数的指针: void (*p)()
	3, 利用指针调用函数

c_060403
	1, 结构体存储空间的算法
	2, 定义结构体的三种方式
	3, 结构体成员的访问

c_060410
	1, 基本数据类型
	2, 构造类型
	3, 指针类型
	4, 枚举类型

c_0701
	1, 宏定义
	2, 取消宏定义
	3, 带参数的宏定义

c_0703
	1, 条件编译

c_0705 
	1, typedef


